package bean;

public class Objects {
    public static void main(String[] args) {

        System.out.println(
                "1. Объект - автомобиль - " + "состояние - исправный, " + "поведение - передвижение");
        System.out.println(
                "2. Объект - маска - " + "состояние - новая, " + "поведение - защищать");
        System.out.println(
                "3. Объект - контейнер - " + "состояние - полный, " + "поведение - открывать");
        System.out.println(
                "4. Объект - калькулятор - " + "состояние - выколючен, , " + "поведение - считать");
        System.out.println(
                "4. Объект - ключ - " + "состояние - металлический, , " + "поведение - открывать");
        System.out.println(
                "5. Объект - телефон - " + "состояние - заряжен, " + "поведение - звонить");
        System.out.println(
                "6. Объект - наушники - " + "состояние - запутанные, " + "поведение - слушать");
        System.out.println(
                "7. Объект - клавиатура - " + "состояние - подключена, " + "поведение - печатать");
        System.out.println(
                "8. Объект - носки - " + "состояние - целые, " + "поведение - одевать");
        System.out.println(
                "9. Объект - дверь - " + "состояние - закрыта, " + "поведение - открывать");
        System.out.println(
                "10. Объект - коллега - " + "состояние - живой, " + "поведение - говорить");
}
    }